// =====Числа и операции над ними в JavaScript==============
// ===задача1===
// Создайте переменную a. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции alert выведите на экран содержимое переменной a.
// let a=1+2+3
// alert (a)
// alert (2+3+4)
// console.log(a)
// console.log(2+3+4)
// ==============Задача 3===================

// Создайте переменную a со значением 10 и переменную b со значением 2. 
// Выведите на экран их сумму, разность, произведение и частное (результат деления).
// let a=10
// let b=2
// console.log(a+b)
// console.log(a-b)
// console.log(a*b)
// console.log(a/b)

// ============Задача 4================

// Создайте переменную c со значением 10 и переменную d со значением 5. 
// Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result
// let c=10
// let d=5
// let result=c+d
// console.log(result)
// ===========Задача 5============

// Создайте переменную a со значением 1, переменную b со значением 2 и переменную c со значением 3. 
// Выведите на экран их сумму.

// let a=1
// let b=2
// let c=3
// console.log(a+b+c)


// =============Задача 6==============

// Создайте переменную a со значением 10 и переменную b со значением 5. 
// Отнимите от a переменную b и результат присвойте переменной c.

// Затем создайте переменную d, присвойте ей значение 7. 
// Сложите переменные c и d, а результат запишите в переменную result. 
// Выведите на экран значение переменной result.

// let a=10
// let b=5
// let c=a-b
// let d=7
// let result=c+d
// console.log(result)
// =============Задача 7==============
// let a = 5 + 5 * 3;
// alert(a);
// =============Задача 8==============
// let a = 5 + 5 * 3 + 3;
// alert(a);
// =============Задача 19==============
// let a=1.5
// let b=0.75
// console.log(a+b)
// =============Задача 20==============
// let a=-100
// console.log(a)
// =============Задача 21==============
// let a=-5
// console.log(-a)
// =============Задача 22==============
// let a=10
// let b=3
// console.log(a%b) //залишок від ділення
// =============Задача 23==============
// let a=2**10
// console.log(a)

// =================================Строки в JavaScript===================================
// ======Задача 1=============

// Создайте переменную str и присвойте ей строку '!!!'. 
// Выведите значение этой переменной на экран.

// let str ='!!!'
// console.log(str)

// ======Задача 2=============

// Создайте переменную с текстом 'java' и переменную с текстом 'script'. 
// С помощью этих переменных и операции сложения строк выведите на экран строку 'javascript'.
// let str='Java'
// let str1='script'
// console.log(str+str1)

// ======Задача 3=============

// Создайте переменную с текстом 'hello' и переменную с текстом 'world'. 
// С помощью этих переменных и операции сложения строк выведите на экран строку 'hello world'.
// let str='hello'
// let str1='word'
// console.log(str,str1)

// ======Задача 4=============

// Создайте переменную name и присвойте ей ваше имя. Выведите на экран фразу 'привет, %имя%'. 
// Вместо %имя% должно подставится значение из переменной name.
// let name='Катя'

// console.log(`Привіт, ${name}`)

// ==========Задача 5=========

// Создайте переменную age и присвойте ей ваш возраст. Выведите на экран 'мне %возраст% лет'. 
// Вместо %возраст% должно подставится значение из переменной age.
// let age='34'

// console.log('мені',age,'роки')

// ==========Задача 7=========
// Запишите в переменную str строку, состоящую из символов 'a', 'b', 'c', 
// причем после каждого символа, кроме последнего, должен стоять перенос строки. 
// Выведите значение переменной на экран.

// let str=`afdsz 
// bfsfgr
// cgdgbfd`

// console.log(str) //перенесення строки

//================ Практика по работе с переменными и операциями в JavaScript==========================
// ==========Задача 1 =========
// Найдите количество секунд в сутках.
// let oneMinute=60
// let oneHoure=60*oneMinute
// let oneDay=24*oneHoure
// let oneMonth=30*oneDay
// let oneYear=12*oneMonth
// let oneDayMimute=oneDay/oneMinute
// let oneYearMinute=oneYear/oneMinute

// console.log(oneHoure, oneDay, oneMonth, oneYear, oneDayMimute, oneYearMinute)

// ==========Задача 11 =========
// Пусть дана переменная r с радиусом круга. 
// По соответствующей формуле найдите площадь круга и запишите ее в переменную s. 
// Выведите содержимое этой переменной на экран.
// let p=3.14
// let r=2
// let s= p*r**2
// console.log(s)
// ==========Задача 12 =========
// Пусть дана переменная a со стороной квадрата. 
// Найдите площадь квадрата и запишите ее в переменную s. 
// Выведите содержимое этой переменной на экран.
// let a=4
// let s=a**2
// console.log(s)
// let a = '5s' * '2';
// alert(a);
// let a = (-'5') + (-'2');
// console.log(a);

// let a = '5' * 1 + '2' * 1;
// alert(a);
// let a = '' + 3 + 1;
// alert(a);
// let arr = [1, 2, 3];
// console.log(arr[arr.length - 1]) 
// ================================================== об'єкти ==================
// const obj={1:'a', 2:'b', 3:'c'};
// console.log(obj);

